app/Http/Controllers/ClientController.php

            }
        }

        $finduserdb = Admin::where('email', $response['data']['email'])->first();
        if (!$finduserdb) {
            $company = Company::where('code', $response['data']['company']['code'])->first();
---
select * from `admins` where `email` = 'rohmadijafar@gmail.com' limit 1
select * from `companies` where `code` = '5ed892d373d17' limit 1

                $company->empty_space = $response['data']['company']['access']['AC']['quota'];
                $company->expired     = $response['data']['company']['access']['AC']['expired'];
                $company->month       = $response['data']['company']['access']['AC']['month'];
                $company->save();
---
insert into `companies` (`code`, `name`, `address`, `website`, `quota`, `empty_space`, `expired`, `month`, `updated_at`, `created_at`) values ('5ed892d373d17', 'Airmas', 'rohmadijafar@gmail.com', 'slow.com', 25, 25, '2020-12-04', 6, '2020-06-05 09:43:47', '2020-06-05 09:43:47')

            $user->save();
        }

        $user = Admin::where('email', $response['data']['email'])->first();
---
select * from `admins` where `email` = 'rohmadijafar@gmail.com' limit 1