app/Http/Controllers/Admin/CheckListController.php

insert into `check_list_employee` (`user_id`, `location_id`, `day`, `check_list_id`, `updated_at`, `created_at`) values ('jafar@airmasgroup.co.id', '1', '[\"senin\",\"selasa\",\"rabu\",\"kamis\",\"jumat\",\"sabtu\",\"minggu\"]', '[\"1\"]', '2020-06-05 14:11:50', '2020-06-05 14:11:50')
insert into `check_list_employee_detail` (`check_list_employee_id`, `day`, `check_list_id`, `updated_at`, `created_at`) values (1, 'senin', '1', '2020-06-05 14:11:50', '2020-06-05 14:11:50')
---
    public function checkListEmployeeSave(CheckListEmployeeSaveRequest $request)
    {
        $findCheckList = CheckListEmployee::where('user_id', $request->user_id)->first();
        if ($findCheckList) {
            $checkListEmployee = $findCheckList;
            $checkListEmployee->checkListEmployeeDetail()->delete();
        } else {
            $checkListEmployee = new CheckListEmployee();
        }

        $checkListEmployee->user_id     = $request->user_id;
        $checkListEmployee->location_id = $request->location_id;
        $checkListEmployee->save();
        foreach ($request->days as $days) {
            foreach ($request->check_list_ids as $check_list_id) {
                $checkListEmployeeDetail                         = new CheckListEmployeeDetail();
                $checkListEmployeeDetail->check_list_employee_id = $checkListEmployee->id;
                $checkListEmployeeDetail->day                    = $days;
                $checkListEmployeeDetail->check_list_id          = $check_list_id;
                $checkListEmployeeDetail->save();