app/Http/Controllers/Admin/CheckListController.php

select * from `check_list_oper_tugas` where 0 = 1
---
    public function index()
    {
        $location = Location::all();

        $checkListProgress =
            CheckListProgress::with([ 'checkListProgressDetail.checkList', 'checkListOperTugas.fromUser', 'checkListUser' ])->withCount([
                    'checkListProgressDetail',
                    'checkListProgressDetail as activeCheckListProgressDetail' => function ($query) {
                        $query->where('status', 1)->orderBy('date', 'desc');
                    },
                ]
            )->whereDate('date', date('Y-m-d'))->get();

        $checkListEmployee = CheckListEmployee::all();
        $checkListOperTugas = CheckListOperTugas::whereDate('end_date', '>=', date('Y-m-d'))->get();