app/Http/Controllers/Admin/CheckListController.php

select * from `location` where (`company` = '7' and `status` = 1)
select * from `check_list_oper_tugas` where `check_list_oper_tugas`.`id` in (2)
select * from `check_list_progress_detail` where `check_list_progress_detail`.`check_list_progress_id` in (7, 8)
select * from `check_list` where `check_list`.`id` in (5)
select * from `location` where `location`.`id` in (7, 8)
select * from `location` where `location`.`id` in (8)
---
	public function index()
	{
		$company  = Auth::user()->company;
		$location = Location::where([
			'company' => $company,
			'status'  => 1,
		])->get();

		$checkListProgress = CheckListProgress::doesnthave('checkListOperTugas.fromUser')->with([
			'checkListProgressDetail.checkList',
			'checkListOperTugas.fromUser',
			'checkListUser',
		])->withCount([
			'checkListProgressDetail',
			'checkListProgressDetail as activeCheckListProgressDetail' => function ($query) {
				$query->where('status', 1)->orderBy('date', 'desc');
			},
		])->where('date', date('Y-m-d'))->get();

		$checkListEmployee  = CheckListEmployee::has('users')->with([
			'users',
			'location',
		])->get();
		$checkListOperTugas =
			CheckListOperTugas::has('fromUser')->with(['location'])->where('end_date', '>=', date('Y-m-d'))->get();

select * from `users` where `company` = '3'
select * from `location` where (`company` = '7' and `status` = 1)
select * from `check_list_oper_tugas` where `check_list_oper_tugas`.`id` in (2)
select * from `check_list_progress_detail` where `check_list_progress_detail`.`check_list_progress_id` in (7, 8)
select * from `check_list` where `check_list`.`id` in (5)
select * from `location` where `location`.`id` in (7, 8)
select * from `location` where `location`.`id` in (8)
---
	public function operTugas()
	{
		$company  = Auth::user()->company;
		$location = Location::where([
			'company' => $company,
			'status'  => 1,
		])->get();

		$checkListProgress = CheckListProgress::has('checkListOperTugas.fromUser')->with([
			'checkListProgressDetail.checkList',
			'checkListOperTugas.fromUser',
			'checkListUser',
		])->withCount([
			'checkListProgressDetail',
			'checkListProgressDetail as activeCheckListProgressDetail' => function ($query) {
				$query->where('status', 1)->orderBy('date', 'desc');
			},
		])->where('date', date('Y-m-d'))->get();

		$checkListEmployee  = CheckListEmployee::has('users')->with([
			'users',
			'location',
		])->get();
		$checkListOperTugas =
			CheckListOperTugas::has('fromUser')->with(['location'])->where('end_date', '>=', date('Y-m-d'))->get();

select * from `users` where `company` = '7'
---
	public function getUserEmployee()
	{
		$user = User::where('company', Auth::user()->company)->get();

select * from `check_list_employee` where `check_list_employee`.`user_id` in ('rohmadijafa123asdar@gmail.com', 'rohmadijafar123@gmail.com')
select * from `location` where `location`.`id` in (7, 8)
select * from `users` where exists (select * from `check_list_employee` where `users`.`email` = `check_list_employee`.`user_id`) and 1 = 1 and `company` = '7'
---
	public function getUserEmployeeHaveCheckList()
	{
		$checkListOperTugas =
			CheckListOperTugas::has('fromUser')->where('end_date', '>=', date('Y-m-d'))->pluck('from_user_Id')->toArray();

		return User::has('checkListEmployee')->whereNotIn('email', $checkListOperTugas)->with('checkListEmployee',
			'checkListEmployee.location')->where('company', Auth::user()->company)->get();

select * from `users` where `email` != 'rohmadijafa123asdar@gmail.com' and `company` = '7'
---
	public function getUserCheckListOperTugasToById($id)
	{
		return User::where('email', '!=', $id)->where('company', Auth::user()->company)->get();

insert into `check_list_employee` (`user_id`, `location_id`, `day`, `check_list_id`, `updated_at`, `created_at`) values ('rohmadijafar123@gmail.com', '7', '[\"senin\",\"selasa\",\"rabu\",\"kamis\",\"jumat\",\"sabtu\",\"minggu\"]', '[\"5\"]', '2020-06-09 15:21:44', '2020-06-09 15:21:44')
insert into `check_list_employee_detail` (`check_list_employee_id`, `day`, `check_list_id`, `updated_at`, `created_at`) values (5, 'senin', '5', '2020-06-09 15:21:44', '2020-06-09 15:21:44')
---
	public function checkListEmployeeSave(CheckListEmployeeSaveRequest $request)
	{
		if (isset($request->id)) {
			$checkListEmployee = CheckListEmployee::where('id', $request->id)->first();
			$checkListEmployee->checkListEmployeeDetail()->delete();
		} else {
			$checkListEmployee = new CheckListEmployee();
		}

		$checkListEmployee->user_id       = $request->user_id;
		$checkListEmployee->location_id   = $request->location_id;
		$checkListEmployee->day           = json_encode($request->days);
		$checkListEmployee->check_list_id = json_encode($request->check_list_ids);
		$checkListEmployee->save();
		foreach ($request->days as $days) {
			foreach ($request->check_list_ids as $check_list_id) {
				$checkListEmployeeDetail                         = new CheckListEmployeeDetail();
				$checkListEmployeeDetail->check_list_employee_id = $checkListEmployee->id;
				$checkListEmployeeDetail->day                    = $days;
				$checkListEmployeeDetail->check_list_id          = $check_list_id;
				$checkListEmployeeDetail->save();

select * from `location` where (`status` = 1 and `company` = '7')
---
	public function getLocation()
	{
		return Location::where([
			'status'  => 1,
			'company' => Auth::user()->company,
		])->get();

select * from `check_list` where (`status` = 1 and `company` = '7')
---
	public function getCheckList()
	{
		return CheckList::where([
			'status'  => 1,
			'company' => Auth::user()->company,
		])->get();

insert into `check_list_oper_tugas` (`from_user_id`, `to_user_id`, `location_id`, `start_date`, `end_date`, `reason`, `updated_at`, `created_at`) values ('rohmadijafa123asdar@gmail.com', 'rohmadijafar123@gmail.com', '8', '2020-06-09', '2020-06-16', 'live', '2020-06-09 15:23:53', '2020-06-09 15:23:53')
---
	public function saveOperTugas(SaveOperTugasListRequest $request)
	{
		$checkListOperTugas               = new CheckListOperTugas();
		$checkListOperTugas->from_user_id = $request->from_user_id;
		$checkListOperTugas->to_user_id   = $request->to_user_id;
		$checkListOperTugas->location_id  = $request->location_id;
		$checkListOperTugas->start_date   = $request->start_date;
		$checkListOperTugas->end_date     = $request->end_date;
		$checkListOperTugas->reason       = $request->reason;
		$checkListOperTugas->save();

select * from `check_list_oper_tugas` where `check_list_oper_tugas`.`id` in (2)
select * from `location` where `location`.`id` in (7, 8)
---
	public function getOnDutyData()
	{
		$checkListProgress = CheckListProgress::has('checkListUser')->with([
			'location',
			'checkListOperTugas.fromUser',
			'checkListUser',
		])->where('date', date('Y-m-d'))->get();

select * from `check_list_oper_tugas` where `check_list_oper_tugas`.`id` in (1)
select * from `check_list_progress_detail` where `check_list_progress_detail`.`check_list_progress_id` in (6)
select * from `check_list` where `check_list`.`id` in (2, 3)
---
	public function filterChecklistProgressDate($date = null, $type = null)
	{
		if ($type == 'tambahTugas') {
			$checkListProgress = CheckListProgress::doesnthave('checkListOperTugas.fromUser')->with([
				'checkListProgressDetail.checkList',
				'checkListUser',
			])->withCount([
				'checkListProgressDetail',
				'checkListProgressDetail as activeCheckListProgressDetail' => function ($query) {
					$query->where('status', 1)->orderBy('date', 'desc');
				},
			])->where('date', $date)->get();

select * from `check_list_oper_tugas` where `check_list_oper_tugas`.`id` in (1, 2)
select * from `check_list_progress_detail` where `check_list_progress_detail`.`check_list_progress_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9)
select * from `check_list` where `check_list`.`id` in (1, 2, 3, 5)
---
	public function report()
	{
		$checkListProgress = CheckListProgress::with([
			'checkListProgressDetail.checkList',
			'checkListOperTugas.fromUser',
			'checkListUser',
		])->withCount([
			'checkListProgressDetail',
			'checkListProgressDetail as activeCheckListProgressDetail' => function ($query) {
				$query->where('status', 1)->orderBy('date', 'desc');
			},
		])->get();