app/Http/Controllers/Admin/LocationController.php

select * from `location` where (`status` = 1 and `company` = '7')
---
	public function index()
	{
		$location = Location::where([
			'status'  => 1,
			'company' => Auth::user()->company,
		])->get();

insert into `location` (`name`, `company`, `user_id`, `updated_at`, `created_at`) values ('fix', '7', 'clouds@gmail.com', '2020-06-09 14:22:07', '2020-06-09 14:22:07')
---
	public function store(LocationRequest $request)
	{
		$login = Auth::user();

		$location          = new Location();
		$location->name    = $request->name;
		$location->company = $login->company;
		$location->user_id = $login->email;
		$location->save();

select * from `location` where (`status` = 1 and `company` = '7')
---
	public function getLocation()
	{
		$location = Location::where([
			'status'  => 1,
			'company' => Auth::user()->company,
		])->get();