app/Http/Controllers/Admin/MenuChecklistController.php

	public function index()
	{
		$location = CheckList::where([
			'status'  => 1,
			'company' => Auth::user()->company,
		])->get();
---
select * from `check_list` where (`status` = 1 and `company` = '7')

	public function store(LocationRequest $request)
	{
		$login = Auth::user();

		$location          = new CheckList();
		$location->name    = $request->name;
		$location->company = $login->company;
		$location->user_id = $login->email;
		$location->save();
---
insert into `check_list` (`name`, `company`, `user_id`, `updated_at`, `created_at`) values ('checklist', '7', 'clouds@gmail.com', '2020-06-09 14:58:23', '2020-06-09 14:58:23')

	public function update($id, LocationRequest $request)
	{
		$location       = CheckList::find($id);
		$location->name = $request->name;
		$location->save();
---
update `check_list` set `name` = 'checkasd', `check_list`.`updated_at` = '2020-06-09 14:59:36' where `id` = 6

	public function getMenuChecklist()
	{
		$location = CheckList::where([
			'status'  => 1,
			'company' => Auth::user()->company,
		])->get();
---
select * from `check_list` where (`status` = 1 and `company` = '7')