app/Http/Controllers/Admin/UserController.php

select * from `users` where (`company` = '3')
select * from `companies` where `id` = '3' limit 1
---
    public function index()
    {

        $user    = User::where(['company' => Auth::user()->company])->get();
        $company = Company::where('id', Auth::user()->company)->first();

insert into `users` (`name`, `password`, `phone_number`, `email`, `access`, `designation`, `department`, `status`, `company`, `phone_code`, `user_phone`, `updated_at`, `created_at`) values ('jafar rohmadi', 'y$uk.F2MMZ.3oz9JIoMBeW3uTp1tNPsvlECWIpMFHYz0PCPMT6qzrNm', '+6285123456786', 'rohmadijafar123@gmail.com', 'user', 'flow', 'flow', 1, '3', '62', '85123456786', '2020-06-05 10:00:26', '2020-06-05 10:00:26')
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'email'        => 'required|unique:users|max:255',
            'phone_number' => 'required|unique:users|max:255',
        ]);

        if ($this->getQuotaLeave() > 0) {
            $company = Auth::user()->company;

            $user               = new User();
            $user->name         = $request->name;
            $user->password     = bcrypt($request->name);
            $user->phone_number = '+'.normalize_phone($request->phone_number);
            $user->email        = $request->email;
            $user->access       = 'user';
            $user->designation  = $request->jabatan;
            $user->department   = $request->department;
            $user->status       = 1;
            $user->company      = $company;
            $user->phone_code   = $request->phone_code;
            $user->user_phone   = normalize_phone($request->user_phone);
            $user->save();

select * from `companies` where `id` = '3' limit 1
select * from `users` where (`company` = '3' and `access` = 'user')
update `companies` set `empty_space` = 23, `companies`.`updated_at` = '2020-06-05 10:00:27' where `id` = 3
---

            Mail::to($user->email)->send(new UserRegistered($data_mail));

            $company = Company::where('id', Auth::user()->company)->first();

            $user                 = User::where(['company' => Auth::user()->company, 'access' => 'user'])->get();
            $company->empty_space = $company->quota - count($user);
            $company->save();

select * from `users` where (`company` = '3')
---
    public function getAllUser()
    {
        $company = Auth::user()->company;

        $user = User::where(['company' => $company])->get();

select * from `users` where (`company` = '7')
---
    public function destroy($id)
    {
        $user = User::where('id', $id)->delete();

        $company              = Company::where('id', Auth::user()->company)->first();
        $user                 = User::where(['company' => Auth::user()->company, 'access' => 'user'])->get();

select * from `companies` where `id` = '3' limit 1
---
    public function getQuotaLeave()
    {
        $company = Company::where('id', Auth::user()->company)->first();